toolchain/ocamlmktop.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ocamlmktop</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="ocamlmktop"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-30 15:44:30 EDT"/>
<meta name="author" content="Hongbo Zhang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../css/style.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">ocamlmktop</h1>





<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a>
<ul>
<li><a href="#sec-1-1">Optimization</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">





<pre class="src src-shell-script">ocamlmktop -o or -I +camlp4 dynlink.cma camlp4rf.cma  
</pre>


<p>
  <code>ocamlmktop</code> is ofen used for <code>pulling native object</code> code
  libraries(typically written in C) into a new toplevel.  { <i>-cclib   libname</i>, <i>-ccopt optioin</i>, <i>-custom</i>, <i>-I dir</i> <i>-o exectuable</i> }
</p>
<p>
  For example:
</p>


<pre class="src src-shell-script">ocamlmktop -custom -o mytoplevel graphics.cma  -cclib -I/usr/X11/lib -cclib -lX11
</pre>


<p>
  This standalone exe(-custom) wil be link the library X11(libX11.a)
  which in turn will be looked up in the path <code>/usr/X11/lib</code>
</p>
<p>
  A standalone exe is a program that <code>does not</code> depend on OCaml
  installation to run.  The OCaml <code>native</code> compiler produces
  standalone executabulars by default. But <code>without</code> <code>-custom</code> option,
  the <code>bytecode</code> compiler produces an executabule which requires the
  bytecode interpreter <code>ocamlrun</code>
</p>



<pre class="src src-shell-script">ocamlc test.ml -o a
ocamlc -custom test.ml -o b
-rwxr-xr-x   1 bob  staff    12225 Dec 23 16:31 a
-rwxr-xr-x   1 bob  staff   198804 Dec 23 16:31 b
</pre>


<p>
  You can see the <b>size</b> of <code>with the ocamlrun</code> is way more bigger
  than <code>a</code>
</p>



<pre class="src src-shell-script">bash-3.2$ cat a | head -n 1
<span style="color: #902522;">#</span><span style="color: #902522;">!/Users/bob/SourceCode/ML/godi/bin/ocamlrun</span>
</pre>


<p>
  Without <code>-custom</code>, it depends on <code>ocamlrun</code>. With <code>-custom</code>, it
  contains the <code>Zinc</code> interpreter as well as the program bytecode,
  this file can be executed directly or copied to another
  machien(using the same CPU/Operating System).  Still, the inclusion
  of machine code means that stand-alone executalbes are not
  protabular to other systems or other architectures.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Optimization</h3>
<div class="outline-text-3" id="text-1-1">


<p>
   It is necessary to not create <code>intermediate closures</code> in the case
   of application on several arguments. For example, when the function
   <code>add</code> is applied with two integers, it is not useful to create the
   first closure corresponding to the function of applying add to the
   first argument. It is necessary to note that the creation of a
   closure would <b>{allocate</b> certain memory space for the environment
   and would require the recovery of that memory space in the
   future. <code>{Automatic memory recovery</code> is the second major
   performance concern, along with environment.
</p>
</div>
</div>
</div>
</div>

<div id="postamble">
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
